// Дано число больше 9. Вывести на экран  вторую цифру числа с конца

int a=7864;
System.Console.WriteLine(a/10%10);
